MikroElektronika/core_packages/PIC/XC8/def/PIC18LF45J50/mcu.h
extern volatile __bit                   LD2                 __at(0x7C62);	// @ (0xF8C * 8 + 2)
#define                                 LD2_bit             _BIT_ACCESS(LATD,2)
// LATD<LD3>
extern volatile __bit                   LD3                 __at(0x7C63);	// @ (0xF8C * 8 + 3)
#define                                 LD3_bit             _BIT_ACCESS(LATD,3)
// LATD<LD4>
extern volatile __bit                   LD4                 __at(0x7C64);	// @ (0xF8C * 8 + 4)
#define                                 LD4_bit             _BIT_ACCESS(LATD,4)
// LATD<LD5>
extern volatile __bit                   LD5                 __at(0x7C65);	// @ (0xF8C * 8 + 5)
#define                                 LD5_bit             _BIT_ACCESS(LATD,5)
// LATD<LD6>
extern volatile __bit                   LD6                 __at(0x7C66);	// @ (0xF8C * 8 + 6)
#define                                 LD6_bit             _BIT_ACCESS(LATD,6)
// LATD<LD7>
extern volatile __bit                   LD7                 __at(0x7C67);	// @ (0xF8C * 8 + 7)
#define                                 LD7_bit             _BIT_ACCESS(LATD,7)
// LATE<LE0>
extern volatile __bit                   LE0                 __at(0x7C68);	// @ (0xF8D * 8 + 0)
#define                                 LE0_bit             _BIT_ACCESS(LATE,0)
// LATE<LE1>
extern volatile __bit                   LE1                 __at(0x7C69);	// @ (0xF8D * 8 + 1)
#define                                 LE1_bit             _BIT_ACCESS(LATE,1)
// LATE<LE2>
extern volatile __bit                   LE2                 __at(0x7C6A);	// @ (0xF8D * 8 + 2)
#define                                 LE2_bit             _BIT_ACCESS(LATE,2)
// PIE2<LVDIE>
extern volatile __bit                   LVDIE               __at(0x7D02);	// @ (0xFA0 * 8 + 2)
#define                                 LVDIE_bit           _BIT_ACCESS(PIE2,2)
// PIR2<LVDIF>
extern volatile __bit                   LVDIF               __at(0x7D0A);	// @ (0xFA1 * 8 + 2)
#define                                 LVDIF_bit           _BIT_ACCESS(PIR2,2)
// PORTA<LVDIN>
extern volatile __bit                   LVDIN               __at(0x7C05);	// @ (0xF80 * 8 + 5)
#define                                 LVDIN_bit           _BIT_ACCESS(PORTA,5)
// IPR2<LVDIP>
extern volatile __bit                   LVDIP               __at(0x7D12);	// @ (0xFA2 * 8 + 2)
#define                                 LVDIP_bit           _BIT_ACCESS(IPR2,2)
// WDTCON<LVDSTAT>
extern volatile __bit                   LVDSTAT             __at(0x7E06);	// @ (0xFC0 * 8 + 6)
#define                                 LVDSTAT_bit         _BIT_ACCESS(WDTCON,6)
// PMMODEH<MODE0>
extern volatile __bit                   MODE0               __at(0x7AE8);	// @ (0xF5D * 8 + 0)
#define                                 MODE0_bit           _BIT_ACCESS(PMMODEH,0)
// PMMODEH<MODE1>
extern volatile __bit                   MODE1               __at(0x7AE9);	// @ (0xF5D * 8 + 1)
#define                                 MODE1_bit           _BIT_ACCESS(PMMODEH,1)
// PMMODEH<MODE16>
extern volatile __bit                   MODE16              __at(0x7AEA);	// @ (0xF5D * 8 + 2)
#define                                 MODE16_bit          _BIT_ACCESS(PMMODEH,2)
// SSP1ADD<MSK0>
extern volatile __bit _DEPRECATED       MSK0                __at(0x7E40);	// @ (0xFC8 * 8 + 0)
#define                                 MSK0_bit            _BIT_ACCESS(SSP1ADD,0)
// SSP1ADD<MSK01>
extern volatile __bit                   MSK01               __at(0x7E40);	// @ (0xFC8 * 8 + 0)
#define                                 MSK01_bit           _BIT_ACCESS(SSP1ADD,0)
// SSP2ADD<MSK02>
extern volatile __bit                   MSK02               __at(0x7BA0);	// @ (0xF74 * 8 + 0)
#define                                 MSK02_bit           _BIT_ACCESS(SSP2ADD,0)
// SSP1ADD<MSK1>
extern volatile __bit _DEPRECATED       MSK1                __at(0x7E41);	// @ (0xFC8 * 8 + 1)
#define                                 MSK1_bit            _BIT_ACCESS(SSP1ADD,1)
// SSP1ADD<MSK11>
extern volatile __bit                   MSK11               __at(0x7E41);	// @ (0xFC8 * 8 + 1)
#define                                 MSK11_bit           _BIT_ACCESS(SSP1ADD,1)
// SSP2ADD<MSK12>
extern volatile __bit                   MSK12               __at(0x7BA1);	// @ (0xF74 * 8 + 1)
#define                                 MSK12_bit           _BIT_ACCESS(SSP2ADD,1)
// SSP1ADD<MSK2>
extern volatile __bit _DEPRECATED       MSK2                __at(0x7E42);	// @ (0xFC8 * 8 + 2)
#define                                 MSK2_bit            _BIT_ACCESS(SSP1ADD,2)
// SSP1ADD<MSK21>
extern volatile __bit                   MSK21               __at(0x7E42);	// @ (0xFC8 * 8 + 2)
#define                                 MSK21_bit           _BIT_ACCESS(SSP1ADD,2)
// SSP2ADD<MSK22>
extern volatile __bit                   MSK22               __at(0x7BA2);	// @ (0xF74 * 8 + 2)
#define                                 MSK22_bit           _BIT_ACCESS(SSP2ADD,2)
// SSP1ADD<MSK3>
extern volatile __bit _DEPRECATED       MSK3                __at(0x7E43);	// @ (0xFC8 * 8 + 3)
#define                                 MSK3_bit            _BIT_ACCESS(SSP1ADD,3)
// SSP1ADD<MSK31>
extern volatile __bit                   MSK31               __at(0x7E43);	// @ (0xFC8 * 8 + 3)
#define                                 MSK31_bit           _BIT_ACCESS(SSP1ADD,3)
// SSP2ADD<MSK32>
extern volatile __bit                   MSK32               __at(0x7BA3);	// @ (0xF74 * 8 + 3)
#define                                 MSK32_bit           _BIT_ACCESS(SSP2ADD,3)
// SSP1ADD<MSK4>
extern volatile __bit _DEPRECATED       MSK4                __at(0x7E44);	// @ (0xFC8 * 8 + 4)
#define                                 MSK4_bit            _BIT_ACCESS(SSP1ADD,4)
// SSP1ADD<MSK41>
extern volatile __bit                   MSK41               __at(0x7E44);	// @ (0xFC8 * 8 + 4)
#define                                 MSK41_bit           _BIT_ACCESS(SSP1ADD,4)
// SSP2ADD<MSK42>
extern volatile __bit                   MSK42               __at(0x7BA4);	// @ (0xF74 * 8 + 4)
#define                                 MSK42_bit           _BIT_ACCESS(SSP2ADD,4)
// SSP1ADD<MSK5>
extern volatile __bit _DEPRECATED       MSK5                __at(0x7E45);	// @ (0xFC8 * 8 + 5)
#define                                 MSK5_bit            _BIT_ACCESS(SSP1ADD,5)
// SSP1ADD<MSK51>
extern volatile __bit                   MSK51               __at(0x7E45);	// @ (0xFC8 * 8 + 5)
#define                                 MSK51_bit           _BIT_ACCESS(SSP1ADD,5)
// SSP2ADD<MSK52>
extern volatile __bit                   MSK52               __at(0x7BA5);	// @ (0xF74 * 8 + 5)
#define                                 MSK52_bit           _BIT_ACCESS(SSP2ADD,5)
// SSP1ADD<MSK6>
extern volatile __bit _DEPRECATED       MSK6                __at(0x7E46);	// @ (0xFC8 * 8 + 6)
#define                                 MSK6_bit            _BIT_ACCESS(SSP1ADD,6)
// SSP1ADD<MSK61>
extern volatile __bit                   MSK61               __at(0x7E46);	// @ (0xFC8 * 8 + 6)
#define                                 MSK61_bit           _BIT_ACCESS(SSP1ADD,6)
// SSP2ADD<MSK62>
extern volatile __bit                   MSK62               __at(0x7BA6);	// @ (0xF74 * 8 + 6)
#define                                 MSK62_bit           _BIT_ACCESS(SSP2ADD,6)
// SSP1ADD<MSK7>
extern volatile __bit _DEPRECATED       MSK7                __at(0x7E47);	// @ (0xFC8 * 8 + 7)
#define                                 MSK7_bit            _BIT_ACCESS(SSP1ADD,7)
// SSP1ADD<MSK71>
extern volatile __bit                   MSK71               __at(0x7E47);	// @ (0xFC8 * 8 + 7)
#define                                 MSK71_bit           _BIT_ACCESS(SSP1ADD,7)
// SSP2ADD<MSK72>
extern volatile __bit                   MSK72               __at(0x7BA7);	// @ (0xF74 * 8 + 7)
#define                                 MSK72_bit           _BIT_ACCESS(SSP2ADD,7)
// STATUS<NEGATIVE>
extern volatile __bit                   NEGATIVE            __at(0x7EC4);	// @ (0xFD8 * 8 + 4)
#define                                 NEGATIVE_bit        _BIT_ACCESS(STATUS,4)
// SSP1STAT<NOT_A>
extern volatile __bit                   NOT_A               __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 NOT_A_bit           _BIT_ACCESS(SSP1STAT,5)
// SSP1STAT<NOT_A1>
extern volatile __bit                   NOT_A1              __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 NOT_A1_bit          _BIT_ACCESS(SSP1STAT,5)
// SSP2STAT<NOT_A2>
extern volatile __bit                   NOT_A2              __at(0x7B9D);	// @ (0xF73 * 8 + 5)
#define                                 NOT_A2_bit          _BIT_ACCESS(SSP2STAT,5)
// SSP1STAT<NOT_ADDRESS>
extern volatile __bit                   NOT_ADDRESS         __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 NOT_ADDRESS_bit     _BIT_ACCESS(SSP1STAT,5)
// SSP1STAT<NOT_ADDRESS1>
extern volatile __bit                   NOT_ADDRESS1        __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 NOT_ADDRESS1_bit    _BIT_ACCESS(SSP1STAT,5)
// SSP2STAT<NOT_ADDRESS2>
extern volatile __bit                   NOT_ADDRESS2        __at(0x7B9D);	// @ (0xF73 * 8 + 5)
#define                                 NOT_ADDRESS2_bit    _BIT_ACCESS(SSP2STAT,5)
// RCON<NOT_BOR>
extern volatile __bit                   NOT_BOR             __at(0x7E80);	// @ (0xFD0 * 8 + 0)
#define                                 NOT_BOR_bit         _BIT_ACCESS(RCON,0)
// RCON<NOT_CM>
extern volatile __bit                   NOT_CM              __at(0x7E85);	// @ (0xFD0 * 8 + 5)
#define                                 NOT_CM_bit          _BIT_ACCESS(RCON,5)
// ADCON0<NOT_DONE>
extern volatile __bit                   NOT_DONE            __at(0x7E11);	// @ (0xFC2 * 8 + 1)
#define                                 NOT_DONE_bit        _BIT_ACCESS(ADCON0,1)
// RCON<NOT_PD>
extern volatile __bit                   NOT_PD              __at(0x7E82);	// @ (0xFD0 * 8 + 2)
#define                                 NOT_PD_bit          _BIT_ACCESS(RCON,2)
// RCON<NOT_POR>
extern volatile __bit                   NOT_POR             __at(0x7E81);	// @ (0xFD0 * 8 + 1)
#define                                 NOT_POR_bit         _BIT_ACCESS(RCON,1)
// INTCON2<NOT_RBPU>
extern volatile __bit                   NOT_RBPU            __at(0x7F8F);	// @ (0xFF1 * 8 + 7)
#define                                 NOT_RBPU_bit        _BIT_ACCESS(INTCON2,7)
// RCSTA1<NOT_RC8>
extern volatile __bit                   NOT_RC8             __at(0x7D66);	// @ (0xFAC * 8 + 6)
#define                                 NOT_RC8_bit         _BIT_ACCESS(RCSTA1,6)
// RCON<NOT_RI>
extern volatile __bit                   NOT_RI              __at(0x7E84);	// @ (0xFD0 * 8 + 4)
#define                                 NOT_RI_bit          _BIT_ACCESS(RCON,4)
// PORTA<NOT_SS1>
extern volatile __bit                   NOT_SS1             __at(0x7C05);	// @ (0xF80 * 8 + 5)
#define                                 NOT_SS1_bit         _BIT_ACCESS(PORTA,5)
// RCON<NOT_TO>
extern volatile __bit                   NOT_TO              __at(0x7E83);	// @ (0xFD0 * 8 + 3)
#define                                 NOT_TO_bit          _BIT_ACCESS(RCON,3)
// TXSTA1<NOT_TX8>
extern volatile __bit                   NOT_TX8             __at(0x7D6E);	// @ (0xFAD * 8 + 6)
#define                                 NOT_TX8_bit         _BIT_ACCESS(TXSTA1,6)
// PORTC<NOT_UOE>
extern volatile __bit                   NOT_UOE             __at(0x7C11);	// @ (0xF82 * 8 + 1)
#define                                 NOT_UOE_bit         _BIT_ACCESS(PORTC,1)
// SSP1STAT<NOT_W>
extern volatile __bit                   NOT_W               __at(0x7E3A);	// @ (0xFC7 * 8 + 2)
#define                                 NOT_W_bit           _BIT_ACCESS(SSP1STAT,2)
// SSP1STAT<NOT_W1>
extern volatile __bit                   NOT_W1              __at(0x7E3A);	// @ (0xFC7 * 8 + 2)
#define                                 NOT_W1_bit          _BIT_ACCESS(SSP1STAT,2)
// SSP2STAT<NOT_W2>
extern volatile __bit                   NOT_W2              __at(0x7B9A);	// @ (0xF73 * 8 + 2)
#define                                 NOT_W2_bit          _BIT_ACCESS(SSP2STAT,2)
// SSP1STAT<NOT_WRITE>
extern volatile __bit                   NOT_WRITE           __at(0x7E3A);	// @ (0xFC7 * 8 + 2)
#define                                 NOT_WRITE_bit       _BIT_ACCESS(SSP1STAT,2)
// SSP1STAT<NOT_WRITE1>
extern volatile __bit                   NOT_WRITE1          __at(0x7E3A);	// @ (0xFC7 * 8 + 2)
#define                                 NOT_WRITE1_bit      _BIT_ACCESS(SSP1STAT,2)
// SSP2STAT<NOT_WRITE2>
extern volatile __bit                   NOT_WRITE2          __at(0x7B9A);	// @ (0xF73 * 8 + 2)
#define                                 NOT_WRITE2_bit      _BIT_ACCESS(SSP2STAT,2)
// PMSTATL<OB0E>
extern volatile __bit                   OB0E                __at(0x7AA0);	// @ (0xF54 * 8 + 0)
#define                                 OB0E_bit            _BIT_ACCESS(PMSTATL,0)
// PMSTATL<OB1E>
extern volatile __bit                   OB1E                __at(0x7AA1);	// @ (0xF54 * 8 + 1)
#define                                 OB1E_bit            _BIT_ACCESS(PMSTATL,1)
// PMSTATL<OB2E>
extern volatile __bit                   OB2E                __at(0x7AA2);	// @ (0xF54 * 8 + 2)
#define                                 OB2E_bit            _BIT_ACCESS(PMSTATL,2)
// PMSTATL<OB3E>
extern volatile __bit                   OB3E                __at(0x7AA3);	// @ (0xF54 * 8 + 3)
#define                                 OB3E_bit            _BIT_ACCESS(PMSTATL,3)
// PMSTATL<OBE>
extern volatile __bit                   OBE                 __at(0x7AA7);	// @ (0xF54 * 8 + 7)
#define                                 OBE_bit             _BIT_ACCESS(PMSTATL,7)
// PMSTATL<OBUF>
extern volatile __bit                   OBUF                __at(0x7AA6);	// @ (0xF54 * 8 + 6)
#define                                 OBUF_bit            _BIT_ACCESS(PMSTATL,6)
// RCSTA1<OERR>
extern volatile __bit _DEPRECATED       OERR                __at(0x7D61);	// @ (0xFAC * 8 + 1)
#define                                 OERR_bit            _BIT_ACCESS(RCSTA1,1)
// RCSTA1<OERR1>
extern volatile __bit                   OERR1               __at(0x7D61);	// @ (0xFAC * 8 + 1)
#define                                 OERR1_bit           _BIT_ACCESS(RCSTA1,1)
// RCSTA2<OERR2>
extern volatile __bit                   OERR2               __at(0x7CE1);	// @ (0xF9C * 8 + 1)
#define                                 OERR2_bit           _BIT_ACCESS(RCSTA2,1)
// PORTA<OSC1>
extern volatile __bit                   OSC1                __at(0x7C07);	// @ (0xF80 * 8 + 7)
#define                                 OSC1_bit            _BIT_ACCESS(PORTA,7)
// PORTA<OSC2>
extern volatile __bit                   OSC2                __at(0x7C06);	// @ (0xF80 * 8 + 6)
#define                                 OSC2_bit            _BIT_ACCESS(PORTA,6)
// PIE2<OSCFIE>
extern volatile __bit                   OSCFIE              __at(0x7D07);	// @ (0xFA0 * 8 + 7)
#define                                 OSCFIE_bit          _BIT_ACCESS(PIE2,7)
// PIR2<OSCFIF>
extern volatile __bit                   OSCFIF              __at(0x7D0F);	// @ (0xFA1 * 8 + 7)
#define                                 OSCFIF_bit          _BIT_ACCESS(PIR2,7)
// IPR2<OSCFIP>
extern volatile __bit                   OSCFIP              __at(0x7D17);	// @ (0xFA2 * 8 + 7)
#define                                 OSCFIP_bit          _BIT_ACCESS(IPR2,7)
// OSCCON<OSTS>
extern volatile __bit                   OSTS                __at(0x7E9B);	// @ (0xFD3 * 8 + 3)
#define                                 OSTS_bit            _BIT_ACCESS(OSCCON,3)
// STATUS<OV>
extern volatile __bit                   OV                  __at(0x7EC3);	// @ (0xFD8 * 8 + 3)
#define                                 OV_bit              _BIT_ACCESS(STATUS,3)
// STATUS<OVERFLOW>
extern volatile __bit                   OVERFLOW            __at(0x7EC3);	// @ (0xFD8 * 8 + 3)
#define                                 OVERFLOW_bit        _BIT_ACCESS(STATUS,3)
// SSP1STAT<P1>
extern volatile __bit                   P1                  __at(0x7E3C);	// @ (0xFC7 * 8 + 4)
#define                                 P1_bit              _BIT_ACCESS(SSP1STAT,4)
// ECCP1DEL<P1DC0>
extern volatile __bit                   P1DC0               __at(0x7DE8);	// @ (0xFBD * 8 + 0)
#define                                 P1DC0_bit           _BIT_ACCESS(ECCP1DEL,0)
// ECCP1DEL<P1DC1>
extern volatile __bit                   P1DC1               __at(0x7DE9);	// @ (0xFBD * 8 + 1)
#define                                 P1DC1_bit           _BIT_ACCESS(ECCP1DEL,1)
// ECCP1DEL<P1DC2>
extern volatile __bit                   P1DC2               __at(0x7DEA);	// @ (0xFBD * 8 + 2)
#define                                 P1DC2_bit           _BIT_ACCESS(ECCP1DEL,2)
// ECCP1DEL<P1DC3>
extern volatile __bit                   P1DC3               __at(0x7DEB);	// @ (0xFBD * 8 + 3)
#define                                 P1DC3_bit           _BIT_ACCESS(ECCP1DEL,3)
// ECCP1DEL<P1DC4>
extern volatile __bit                   P1DC4               __at(0x7DEC);	// @ (0xFBD * 8 + 4)
#define                                 P1DC4_bit           _BIT_ACCESS(ECCP1DEL,4)
// ECCP1DEL<P1DC5>
extern volatile __bit                   P1DC5               __at(0x7DED);	// @ (0xFBD * 8 + 5)
#define                                 P1DC5_bit           _BIT_ACCESS(ECCP1DEL,5)
// ECCP1DEL<P1DC6>
extern volatile __bit                   P1DC6               __at(0x7DEE);	// @ (0xFBD * 8 + 6)
#define                                 P1DC6_bit           _BIT_ACCESS(ECCP1DEL,6)
// CCP1CON<P1M0>
extern volatile __bit                   P1M0                __at(0x7DD6);	// @ (0xFBA * 8 + 6)
#define                                 P1M0_bit            _BIT_ACCESS(CCP1CON,6)
// CCP1CON<P1M1>
extern volatile __bit                   P1M1                __at(0x7DD7);	// @ (0xFBA * 8 + 7)
#define                                 P1M1_bit            _BIT_ACCESS(CCP1CON,7)
// ECCP1DEL<P1RSEN>
extern volatile __bit                   P1RSEN              __at(0x7DEF);	// @ (0xFBD * 8 + 7)
#define                                 P1RSEN_bit          _BIT_ACCESS(ECCP1DEL,7)
// SSP2STAT<P2>
extern volatile __bit                   P2                  __at(0x7B9C);	// @ (0xF73 * 8 + 4)
#define                                 P2_bit              _BIT_ACCESS(SSP2STAT,4)
// ECCP2DEL<P2DC0>
extern volatile __bit _DEPRECATED       P2DC0               __at(0x7DB8);	// @ (0xFB7 * 8 + 0)
#define                                 P2DC0_bit           _BIT_ACCESS(ECCP2DEL,0)
// PSTR2CON<P2DC02>
extern volatile __bit                   P2DC02              __at(0x7DC8);	// @ (0xFB9 * 8 + 0)
#define                                 P2DC02_bit          _BIT_ACCESS(PSTR2CON,0)
// PSTR2CON<P2DC0CON>
extern volatile __bit                   P2DC0CON            __at(0x7DC8);	// @ (0xFB9 * 8 + 0)
#define                                 P2DC0CON_bit        _BIT_ACCESS(PSTR2CON,0)
// ECCP2DEL<P2DC1>
extern volatile __bit _DEPRECATED       P2DC1               __at(0x7DB9);	// @ (0xFB7 * 8 + 1)
#define                                 P2DC1_bit           _BIT_ACCESS(ECCP2DEL,1)
// PSTR2CON<P2DC12>
extern volatile __bit                   P2DC12              __at(0x7DC9);	// @ (0xFB9 * 8 + 1)
#define                                 P2DC12_bit          _BIT_ACCESS(PSTR2CON,1)
// PSTR2CON<P2DC1CON>
extern volatile __bit                   P2DC1CON            __at(0x7DC9);	// @ (0xFB9 * 8 + 1)
#define                                 P2DC1CON_bit        _BIT_ACCESS(PSTR2CON,1)
// ECCP2DEL<P2DC2>
extern volatile __bit _DEPRECATED       P2DC2               __at(0x7DBA);	// @ (0xFB7 * 8 + 2)
#define                                 P2DC2_bit           _BIT_ACCESS(ECCP2DEL,2)
// PSTR2CON<P2DC22>
extern volatile __bit                   P2DC22              __at(0x7DCA);	// @ (0xFB9 * 8 + 2)
#define                                 P2DC22_bit          _BIT_ACCESS(PSTR2CON,2)
// PSTR2CON<P2DC2CON>
extern volatile __bit                   P2DC2CON            __at(0x7DCA);	// @ (0xFB9 * 8 + 2)
#define                                 P2DC2CON_bit        _BIT_ACCESS(PSTR2CON,2)
// ECCP2DEL<P2DC3>
extern volatile __bit _DEPRECATED       P2DC3               __at(0x7DBB);	// @ (0xFB7 * 8 + 3)
#define                                 P2DC3_bit           _BIT_ACCESS(ECCP2DEL,3)
// PSTR2CON<P2DC32>
extern volatile __bit                   P2DC32              __at(0x7DCB);	// @ (0xFB9 * 8 + 3)
#define                                 P2DC32_bit          _BIT_ACCESS(PSTR2CON,3)
// PSTR2CON<P2DC3CON>
extern volatile __bit                   P2DC3CON            __at(0x7DCB);	// @ (0xFB9 * 8 + 3)
#define                                 P2DC3CON_bit        _BIT_ACCESS(PSTR2CON,3)
// ECCP2DEL<P2DC4>
extern volatile __bit _DEPRECATED       P2DC4               __at(0x7DBC);	// @ (0xFB7 * 8 + 4)
#define                                 P2DC4_bit           _BIT_ACCESS(ECCP2DEL,4)
// PSTR2CON<P2DC42>
extern volatile __bit                   P2DC42              __at(0x7DCC);	// @ (0xFB9 * 8 + 4)
#define                                 P2DC42_bit          _BIT_ACCESS(PSTR2CON,4)
// PSTR2CON<P2DC4CON>
extern volatile __bit                   P2DC4CON            __at(0x7DCC);	// @ (0xFB9 * 8 + 4)
#define                                 P2DC4CON_bit        _BIT_ACCESS(PSTR2CON,4)
// ECCP2DEL<P2DC5>
extern volatile __bit _DEPRECATED       P2DC5               __at(0x7DBD);	// @ (0xFB7 * 8 + 5)
#define                                 P2DC5_bit           _BIT_ACCESS(ECCP2DEL,5)
// PSTR2CON<P2DC52>
extern volatile __bit                   P2DC52              __at(0x7DCD);	// @ (0xFB9 * 8 + 5)
#define                                 P2DC52_bit          _BIT_ACCESS(PSTR2CON,5)
// PSTR2CON<P2DC5CON>
extern volatile __bit                   P2DC5CON            __at(0x7DCD);	// @ (0xFB9 * 8 + 5)
#define                                 P2DC5CON_bit        _BIT_ACCESS(PSTR2CON,5)
// ECCP2DEL<P2DC6>
extern volatile __bit _DEPRECATED       P2DC6               __at(0x7DBE);	// @ (0xFB7 * 8 + 6)
#define                                 P2DC6_bit           _BIT_ACCESS(ECCP2DEL,6)
// PSTR2CON<P2DC62>
extern volatile __bit                   P2DC62              __at(0x7DCE);	// @ (0xFB9 * 8 + 6)
#define                                 P2DC62_bit          _BIT_ACCESS(PSTR2CON,6)
// PSTR2CON<P2DC6CON>
extern volatile __bit                   P2DC6CON            __at(0x7DCE);	// @ (0xFB9 * 8 + 6)
#define                                 P2DC6CON_bit        _BIT_ACCESS(PSTR2CON,6)
// CCP2CON<P2M0>
extern volatile __bit                   P2M0                __at(0x7DA6);	// @ (0xFB4 * 8 + 6)
#define                                 P2M0_bit            _BIT_ACCESS(CCP2CON,6)
// CCP2CON<P2M1>
extern volatile __bit                   P2M1                __at(0x7DA7);	// @ (0xFB4 * 8 + 7)
#define                                 P2M1_bit            _BIT_ACCESS(CCP2CON,7)
// ECCP2DEL<P2RSEN>
extern volatile __bit                   P2RSEN              __at(0x7DBF);	// @ (0xFB7 * 8 + 7)
#define                                 P2RSEN_bit          _BIT_ACCESS(ECCP2DEL,7)
// PORTC<PA1>
extern volatile __bit                   PA1                 __at(0x7C12);	// @ (0xF82 * 8 + 2)
#define                                 PA1_bit             _BIT_ACCESS(PORTC,2)
// PORTC<PA2>
extern volatile __bit                   PA2                 __at(0x7C11);	// @ (0xF82 * 8 + 1)
#define                                 PA2_bit             _BIT_ACCESS(PORTC,1)
// PORTE<PA2E>
extern volatile __bit                   PA2E                __at(0x7C27);	// @ (0xF84 * 8 + 7)
#define                                 PA2E_bit            _BIT_ACCESS(PORTE,7)
// PORTE<PB1E>
extern volatile __bit                   PB1E                __at(0x7C26);	// @ (0xF84 * 8 + 6)
